InformationRegisters/МестаПримененияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестаПримененияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаПримененияЭлементовКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаПримененияЭлементовКонструктораВидовПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.РегистрыСведений.МестаПримененияЭлементовКонструктораВидовПродукцииИС.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьМестаПримененияЭлементовКонструктораИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьМестаПримененияЭлементовКонструктораИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления)
	
	Идентификаторы                = ПараметрыЗагрузки.Идентификаторы;
	МестаПримененияКЗагрузке      = ДанныеКлассификатора.МестаПримененияЭлементовКонструктора;
	ЗагрузкаИзменений             = ПараметрыЗагрузки.ЗагрузкаИзменений;
	ПолноеИмяСправочникаЭлементов = Метаданные.Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолноеИмя();
	ИмяТаблицыМестПрименения      = Метаданные.Справочники.МестаПримененияЭлементовКонструктораВидовПродукцииИС.ПолноеИмя();
	
	ТаблицаКЗагрузке = Новый ТаблицаЗначений;
	ТаблицаКЗагрузке.Колонки.Добавить("МестоПрименения",     Новый ОписаниеТипов("СправочникСсылка.МестаПримененияЭлементовКонструктораВидовПродукцииИС"));
	ТаблицаКЗагрузке.Колонки.Добавить("ЭлементКонструктора", Новый ОписаниеТипов("СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС"));
	ТаблицаКЗагрузке.Колонки.Добавить("Изменен",             Новый ОписаниеТипов("Булево"));
	ТаблицаКЗагрузке.Колонки.Добавить("ПометкаУдаления",     Новый ОписаниеТипов("Булево"));
	
    Для Каждого СтрокаКЗагрузке Из МестаПримененияКЗагрузке Цикл
		СтруктураПоиска = Новый Структура;
        СтруктураПоиска.Вставить("ИмяТаблицы",   ПолноеИмяСправочникаЭлементов);
        СтруктураПоиска.Вставить("Наименование", СтрокаКЗагрузке.ЭлементКонструктора);
		
		НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			ЭлементКонструктораСсылка = НайденныеСтроки[0].Ссылка;
		Иначе
			Если ПараметрыЗагрузки.РежимОтладки Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Внутренняя ошибка поиска элемента конструктора %1'"),
					СтрокаКЗагрузке.ЭлементКонструктора);
			Иначе
				РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
     	
     	СтруктураПоиска = Новый Структура;
     	СтруктураПоиска.Вставить("ИмяТаблицы",    ИмяТаблицыМестПрименения);
     	СтруктураПоиска.Вставить("Идентификатор", СтрокаКЗагрузке.МестоПримененияИдентификатор);
		СтруктураПоиска.Вставить("Наименование",  СтрокаКЗагрузке.МестоПримененияНаименование);
		
		НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			МестоПримененияСсылка = НайденныеСтроки[0].Ссылка;
		Иначе
			РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(МестоПримененияСсылка) Тогда
			РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаКЗагрузке.Добавить();
		
		НоваяСтрока.МестоПрименения     = МестоПримененияСсылка;
		НоваяСтрока.ЭлементКонструктора = ЭлементКонструктораСсылка;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКЗагрузке, , "ЭлементКонструктора");

	КонецЦикла;
    
    Если ЗагрузкаИзменений Тогда
		Для Каждого СтрокаИзменений Из ТаблицаКЗагрузке Цикл
			ЗаписьМестоПрименения = СоздатьМенеджерЗаписи();
			ЗаписьМестоПрименения.МестоПрименения     = СтрокаИзменений.МестоПрименения;
			ЗаписьМестоПрименения.ЭлементКонструктора = СтрокаИзменений.ЭлементКонструктора;

			ЗаписьМестоПрименения.Прочитать();
			
			ЗаполнитьЗначенияСвойств(ЗаписьМестоПрименения, СтрокаИзменений);
			
			ЗаписьМестоПрименения.Записать();

		КонецЦикла;
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаКЗагрузке.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ТаблицаКЗагрузке.МестоПрименения КАК МестоПрименения,
		|	ТаблицаКЗагрузке.Изменен КАК Изменен,
		|	ТаблицаКЗагрузке.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ втЗагружаемыеДанные
		|ИЗ
		|	&ТаблицаКЗагрузке КАК ТаблицаКЗагрузке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(МестаПримененияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора, НЕОПРЕДЕЛЕНО) КАК
		|		ЭлементКонструктора,
		|	МестаПримененияЭлементовКонструктораВидовПродукцииИС.МестоПрименения КАК МестоПрименения,
		|	МестаПримененияЭлементовКонструктораВидовПродукцииИС.Изменен КАК Изменен,
		|	МестаПримененияЭлементовКонструктораВидовПродукцииИС.ПометкаУдаления КАК ПометкаУдаления,
		|	ЕСТЬNULL(втЗагружаемыеДанные.ЭлементКонструктора, НЕОПРЕДЕЛЕНО) КАК ЭлементКонструктораПоставляемый,
		|	втЗагружаемыеДанные.МестоПрименения КАК МестоПримененияПоставляемый,
		|	втЗагружаемыеДанные.Изменен КАК ИзмененПоставляемый,
		|	втЗагружаемыеДанные.ПометкаУдаления КАК ПометкаУдаленияПоставляемый
		|ИЗ
		|	РегистрСведений.МестаПримененияЭлементовКонструктораВидовПродукцииИС КАК
		|		МестаПримененияЭлементовКонструктораВидовПродукцииИС
		|		ПОЛНОЕ СОЕДИНЕНИЕ втЗагружаемыеДанные КАК втЗагружаемыеДанные
		|		ПО МестаПримененияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = втЗагружаемыеДанные.ЭлементКонструктора
		|		И МестаПримененияЭлементовКонструктораВидовПродукцииИС.МестоПрименения = втЗагружаемыеДанные.МестоПрименения";
		Запрос.УстановитьПараметр("ТаблицаКЗагрузке", ТаблицаКЗагрузке);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		НаборЗаписей = СоздатьНаборЗаписей();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ЭлементКонструктора = Неопределено Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ЭлементКонструктора = ВыборкаДетальныеЗаписи.ЭлементКонструктораПоставляемый;
				НоваяЗапись.МестоПрименения     = ВыборкаДетальныеЗаписи.МестоПримененияПоставляемый;
				НоваяЗапись.Изменен             = ВыборкаДетальныеЗаписи.ИзмененПоставляемый;
				НоваяЗапись.ПометкаУдаления     = ВыборкаДетальныеЗаписи.ПометкаУдаленияПоставляемый;
			Иначе
				Если ВыборкаДетальныеЗаписи.ЭлементКонструктораПоставляемый = Неопределено Тогда
					Если ВыборкаДетальныеЗаписи.Изменен И Не ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
						НоваяЗапись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
					ИначеЕсли ВыборкаДетальныеЗаписи.Изменен И ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
						Продолжить;
					КонецЕсли;
				Иначе
					НоваяЗапись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
					Если ВыборкаДетальныеЗаписи.Изменен И Не ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
						НоваяЗапись.Изменен = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		НаборЗаписей.Записать();
    	
    КонецЕсли;
        	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
